КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ПолномочияДействий/КонтурЛогистика_ПолномочияДействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ПолномочияДействий</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Платежи</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ПолномочияДействий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗначениеДляXDTO(Ссылка) Экспорт

	Если Ссылка = Заказ Тогда 
		Результат = "1";
	ИначеЕсли Ссылка = Погрузка Тогда 
		Результат = "2";
	ИначеЕсли Ссылка = Платежи Тогда 
		Результат = "3";
	Иначе
		ВызватьИсключение "Для заполнения в xml передано неверное значение группы упаковки: " + Ссылка;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ЗначениеИзXDTO(ЗначениеИзXDTO) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если ЗначениеИзXDTO = "1" Тогда 
		Результат = Заказ;
	ИначеЕсли ЗначениеИзXDTO = "2" Тогда 
		Результат = Погрузка;
	ИначеЕсли ЗначениеИзXDTO = "3" Тогда 
		Результат = Платежи;
	Иначе
		Результат = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

#КонецЕсли
